docs/programming_languages.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>programming-languages</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container">
<nav aria-label="breadcrumb" style="--pico-nav-breadcrumb-divider: '|';" id="org6425e89">
<ul class="org-ul">
<li><a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a></li>
<li><a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a></li>
</ul>
</nav>
<div id="outline-container-org7e082ce" class="outline-2">
<h2 id="org7e082ce">Programming Languages</h2>
<div class="outline-text-2" id="text-org7e082ce">
<p>
The tower of babel is your type system as a macro
</p>
</div>
<div id="outline-container-orgbd3100e" class="outline-3">
<h3 id="orgbd3100e">shell</h3>
<div class="outline-text-3" id="text-orgbd3100e">
<ul class="org-ul">
<li>use <code>shellcheck</code> for common issues and errors in scripts</li>
<li>sh
<ul class="org-ul">
<li>posix shell</li>
<li><a href="https://pubs.opengroup.org/onlinepubs/9699919799.2018edition/utilities/sh.html">https://pubs.opengroup.org/onlinepubs/9699919799.2018edition/utilities/sh.html</a></li>
<li><code>cmd 2&gt;&amp;1 | tee -- "log.txt"</code></li>
</ul></li>
<li><a href="bash.html#ID-b3b9d8e3-c20f-49ec-acf7-0cb2cf4a6c1a">bash</a></li>
<li><a href="zsh.html#ID-948e8828-a510-4088-a846-888cfc719914">zsh</a></li>
<li>ksh
<ul class="org-ul">
<li>setenv for environment variables</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8c284de" class="outline-3">
<h3 id="org8c284de"><a href="c_lang.html#ID-12a3e66b-5ada-4bfc-ab64-819a0d46d204">c</a></h3>
</div>
<div id="outline-container-org4588461" class="outline-3">
<h3 id="org4588461">c++</h3>
<div class="outline-text-3" id="text-org4588461">
<ul class="org-ul">
<li><a href="https://isocpp.github.io/CppCoreGuidelines/CppCoreGuidelines">https://isocpp.github.io/CppCoreGuidelines/CppCoreGuidelines</a></li>
<li>gcc &lt; 11 can be built with c++98; c++11 required for 11+</li>
<li><code>static_assert</code> compile time checks UB and leaks</li>
<li>RTTI can be used for runtime reflection</li>
<li>c++11
<ul class="org-ul">
<li>constexpr, unique<sub>ptr</sub>, move semantics, memory model</li>
</ul></li>
<li>c++14
<ul class="org-ul">
<li>reader writer locks</li>
</ul></li>
<li>c++17
<ul class="org-ul">
<li>parallell stl, std filesystem</li>
</ul></li>
<li>c++20
<ul class="org-ul">
<li>modules, concepts(templates constraints), ranges, coroutines</li>
</ul></li>
<li>c++23
<ul class="org-ul">
<li>generators, import std;, std::expected</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgde3d2e6" class="outline-3">
<h3 id="orgde3d2e6"><a href="rust.html#ID-e518d6e6-18f5-4bb5-8b92-135b125b5797">rust</a></h3>
<div class="outline-text-3" id="text-orgde3d2e6">
<ul class="org-ul">
<li>win 7 support removed in 1.75</li>
<li><code>rr record -c 10000 &lt;program&gt; &lt;args&gt;</code> context switches thread after 10000 cpu ticks</li>
<li>musl added dns tcp in 1.2.4</li>
<li><a href="https://github.com/xtuc/wasm-coredump/tree/main">wasm core dump debugging with wasmgdb</a></li>
<li><a href="gdb.html#ID-3d101bb5-0125-41bc-9678-e43487122c7d">gdb</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgdfa2bc2" class="outline-3">
<h3 id="orgdfa2bc2"><a href="css.html#ID-a168933c-6a2b-456e-9fd0-760c5bc180dc">css</a></h3>
<div class="outline-text-3" id="text-orgdfa2bc2">
<ul class="org-ul">
<li>colors with hex or oklch</li>
<li><a href="https://github.com/whatwg/html">https://github.com/whatwg/html</a> for spec</li>
<li>document.designMode="on" for inline editing</li>
</ul>
</div>
</div>
<div id="outline-container-org2547597" class="outline-3">
<h3 id="org2547597"><a href="make.html#ID-7c407252-45a1-41a6-901a-cfdb19a6ac36">make</a></h3>
</div>
<div id="outline-container-orgdea16b5" class="outline-3">
<h3 id="orgdea16b5"><a href="elixir.html#ID-0713d4b4-4d66-495b-9d1b-192c91a8ab9f">elixir</a></h3>
</div>
<div id="outline-container-orgbc39ad7" class="outline-3">
<h3 id="orgbc39ad7"><a href="julia.html#ID-b4f4114e-75e8-4312-8c96-5567ca6d6b80">julia</a></h3>
</div>
<div id="outline-container-org3488275" class="outline-3">
<h3 id="org3488275"><a href="golang.html#ID-ec8d7fc7-d5fa-4265-b795-043a5e55cd33">golang</a></h3>
</div>
<div id="outline-container-org74498b1" class="outline-3">
<h3 id="org74498b1"><a href="ruby.html#ID-0a869230-4f44-4e06-97a1-e35ec5cde213">ruby</a></h3>
</div>
<div id="outline-container-orgd8a6277" class="outline-3">
<h3 id="orgd8a6277">jvm</h3>
<div class="outline-text-3" id="text-orgd8a6277">
<ul class="org-ul">
<li>Valhalla for value objects (remove boxing overhead)</li>
<li>Loom for user mode green threads</li>
<li>panama for native library linkage</li>
</ul>
</div>
<div id="outline-container-org7f67846" class="outline-4">
<h4 id="org7f67846"><a href="java.html#ID-2b605045-23e1-4995-9ed4-843699a0481f">java</a></h4>
</div>
</div>
<div id="outline-container-org72da40b" class="outline-3">
<h3 id="org72da40b">javascript</h3>
<div class="outline-text-3" id="text-org72da40b">
</div>
<div id="outline-container-org23152bb" class="outline-4">
<h4 id="org23152bb">typescript</h4>
<div class="outline-text-4" id="text-org23152bb">
<ul class="org-ul">
<li>compiles to javascript</li>
<li>any type for escape</li>
<li>deno run npm package with <code>deno run --allow-all npm:SomeSuchCommand</code> or a ts file with <code>import express from "npm:express@^4.20"</code>
<ul class="org-ul">
<li><code>package.json</code> scripts can be run with <code>deno task</code></li>
<li>based on v8</li>
</ul></li>
<li>bun run npm package
<ul class="org-ul">
<li>bun profile builds are debug and baseline exclude avx2</li>
<li>based on webkits javascriptcore</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb4b85ee" class="outline-3">
<h3 id="orgb4b85ee">DSL</h3>
<div class="outline-text-3" id="text-orgb4b85ee">
</div>
<div id="outline-container-orgd059084" class="outline-4">
<h4 id="orgd059084"><a href="https://github.com/open-goal/jak-project">GOAL</a></h4>
<div class="outline-text-4" id="text-orgd059084">
<ul class="org-ul">
<li>jak 1-3 lisp game implementation</li>
</ul>
</div>
</div>
<div id="outline-container-org06107de" class="outline-4">
<h4 id="org06107de"><a href="docker.html#ID-6cb9147a-f7ca-4b2f-af98-14347eaba82f">docker</a></h4>
</div>
<div id="outline-container-orga6dbb32" class="outline-4">
<h4 id="orga6dbb32"><a href="gradle.html#ID-b8d0efc3-099f-4791-b65a-a168ff56aafd">gradle</a></h4>
</div>
</div>
<div id="outline-container-orgc09bd9d" class="outline-3">
<h3 id="orgc09bd9d">WASM</h3>
<div class="outline-text-3" id="text-orgc09bd9d">
<ul class="org-ul">
<li>sexp text format</li>
<li>stack based vm instructions</li>
<li>function table</li>
<li>interoperability
<ul class="org-ul">
<li>js with SharedArrayBuffer</li>
<li>WASI for host</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org1058509" class="outline-3">
<h3 id="org1058509"><a href="python.html#ID-a7f0c442-c2ec-4d7e-bc65-628631138d81">python</a></h3>
</div>
<div id="outline-container-org8aeb541" class="outline-3">
<h3 id="org8aeb541">asm</h3>
<div class="outline-text-3" id="text-org8aeb541">
</div>
<div id="outline-container-org2b5d3cb" class="outline-4">
<h4 id="org2b5d3cb">x86</h4>
<div class="outline-text-4" id="text-org2b5d3cb">
<ul class="org-ul">
<li>calling convention of setting registers and jumping</li>
<li>SIMD (xmmx) SSE/AVX(512)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5da9227" class="outline-3">
<h3 id="org5da9227"><a href="zig.html#ID-bf21269e-5bf5-4c51-be58-4c040d905e25">zig</a></h3>
</div>
<div id="outline-container-orga4da0b7" class="outline-3">
<h3 id="orga4da0b7">lisp</h3>
<div class="outline-text-3" id="text-orga4da0b7">
</div>
<div id="outline-container-org1adf404" class="outline-4">
<h4 id="org1adf404">scheme</h4>
<div class="outline-text-4" id="text-org1adf404">
<ul class="org-ul">
<li><a href="guile.html#ID-d6237a00-1daa-4752-b311-1749950f4f6e">guile</a></li>
<li>prescheme
<ul class="org-ul">
<li>manual memory management</li>
<li>static type system</li>
<li>verified prescheme to C compiler</li>
<li>operating system 3L compiler/vm written in prescheme</li>
<li>guile-prescheme interop</li>
</ul></li>
<li>gnu mes
<ul class="org-ul">
<li>scheme interpreter in C and C compiler in scheme used for bootstrapping guile/guix with gash</li>
</ul></li>
<li>chicken scheme
<ul class="org-ul">
<li>scheme to C compiler</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org940e145" class="outline-4">
<h4 id="org940e145"><a href="clojure.html#ID-fd6e2c21-220f-4d63-ab7e-5004dc053e5b">clojure</a></h4>
</div>
<div id="outline-container-orgd567cfe" class="outline-4">
<h4 id="orgd567cfe">elisp</h4>
<div class="outline-text-4" id="text-orgd567cfe">
<ul class="org-ul">
<li>eieio for objects</li>
</ul>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
